Revit 2027 API
DirectShape.IsValidCategoryId Method
 Test the category id to make sure the category is allowed for a DirectShape or DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCategoryId(
	ElementId categoryId,
	Document doc
)
Public Shared Function IsValidCategoryId (
	categoryId As ElementId,
	doc As Document
) As Boolean
public:
static bool IsValidCategoryId(
	ElementId^ categoryId,
	Document^ doc
)
static member IsValidCategoryId :
        categoryId : ElementId *
        doc : Document -> bool
Parameters
categoryId ElementId
 Category id to be tested.
doc Document
 Document to look up the category by id.
Return Value
Boolean
 True if the category is allowed for a DirectShape or DirectShapeType, false if not.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace